
&НаСервере
Процедура СвязиНаСервере(текОбъект) 
    тВид 	= Строка(текОбъект.Вид);
	ИД 		= текОбъект.Индентификатор;
	
	Для Каждого Метаданное Из Метаданные[тВид][ИД].Реквизиты Цикл
		ТипыР = Метаданное.Тип.Типы();
		ТипР = "";
		Для Каждого стрТип Из ТипыР Цикл  
			РеквизитТип = Неопределено;
			ПоискТип 	= Метаданные.НайтиПоТипу(стрТип);
			Если Не ПоискТип = Неопределено Тогда 
				//РеквизитТип 		= Метаданное.Тип;	
			//Иначе 	
				ТипР = ТипР + ?(ТипР = "","","; ") + Метаданные.НайтиПоТипу(стрТип).ПолноеИмя(); 
				
				//ПоискДокумент 	= СтрНайти(ТипР,"Документ");
				ПоискСправочник = СтрНайти(ТипР,"Справочник");
									
				Если СтрНайти(ТипР,"Справочник") > 0 Тогда 
					НоваяСтрока = Объект.АС_Справочники.Добавить();
					НоваяСтрока.АС_Тип 			= ТипР;  //!!Проверка что такого типа нет
					НоваяСтрока.АС_Справочник 	= Справочники.АС_Объекты.НайтиПоНаименованию(Метаданное.Синоним); //!! искать Вид + Наименование
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСвязи(Команда) 
	текОбъект = Элементы.АС_Справочники.ТекущиеДанные.АС_Справочник;
	СвязиНаСервере(текОбъект);
КонецПроцедуры
