
&НаСервере
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	 Объект.НазваниеВерсияКонфигурации =  Метаданные.Имя + " " + Метаданные.Версия;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	Объект.ок_Метаданные.Очистить(); 
	
	ЗаполнитьТЧМетаданные("Справочники"); 
    ЗаполнитьТЧМетаданные("Документы");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧМетаданные(Имя) 
	
	Для Каждого Метаданное Из Метаданные[Имя] Цикл 
		НовСтрока = Объект.ок_Метаданные.Добавить();
		НовСтрока.Имя 		= Метаданное.Имя;
		НовСтрока.Синоним 	= Метаданное.Синоним;  
		//НовСтрока.ок_Объект 	= Справочники.АС_Объекты.НайтиПоНаименованию(Метаданное.Синоним); //!! искать Вид + Наименование 
		Если ЗначениеЗаполнено(НовСтрока.ок_Объект) Тогда 
		Иначе
			НовСтрока.ВидОбъекта = Перечисления.ок_ВидОбъектов[Имя]; 	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры	

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры
