
&НаСервере
Процедура КомандаЗаполнитьНаСервере() 
	
	АС_ОбщийМодульСервер.ЗаполнитьРеквизитыОбъектаАС(Объект.Ссылка); 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда) 
	
	КомандаЗаполнитьНаСервере();
	
	ЭтаФорма.Прочитать(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцедурыФункцииПриАктивизацииСтроки(Элемент) 
	Если Объект.ПроцедурыФункции.Количество() > 0 Тогда 
		СпрСсылка = Элементы.ПроцедурыФункции.ТекущиеДанные.Наименование;
		ЗаполнитьОписаниеТекстомФункции(СпрСсылка);
	КонецЕсли;
КонецПроцедуры  

 &НаСервере
 Процедура ЗаполнитьОписаниеТекстомФункции(СпрСсылка)
	 
	 Объект.Описание =   СпрСсылка.ТекстМодуля;
	 
КонецПроцедуры	 
