
&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	
	Объект.АС_Объекты.Очистить(); 
	
	Для Каждого Метаданное Из Метаданные.Справочники Цикл 
		НовСтрока = Объект.АС_Объекты.Добавить();
		НовСтрока.АС_Имя 		= Метаданное.Имя;
		НовСтрока.АС_Синоним 	= Метаданное.Синоним;  
		НовСтрока.АС_Объект 	= Справочники.АС_Объекты.НайтиПоНаименованию(Метаданное.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	Объект.НазваниеВерсияКонфигурации =  Метаданные.КраткаяИнформация + " " + Метаданные.Версия;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьОбъект(Команда)
	ТекСтрока = Элементы.АС_Объекты.ТекущиеДанные;
	
	Структура = Новый Структура;
	Если ЗначениеЗаполнено(ТекСтрока.АС_Объект) = Ложь Тогда 
		Структура.Вставить("Индентификатор"	, ТекСтрока.АС_Имя);
		Структура.Вставить("Наименование"	, ТекСтрока.АС_Синоним);  
		Структура.Вставить("Вид" 			, Объект.ВидОбъекта);
		
		ОбъектАС = АС_ОбщийМодульСервер.СоздатьОбъектАС(Структура);   
		
		ТекСтрока.АС_Объект = ОбъектАС; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АС_СвязиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//Если НоваяСтрока Тогда 
	//	текСтрока = Элементы.АС_Связи.ТекущиеДанные;  
	//	кол = Объект.АС_Связи.Количество()-1;
	//	Объект.АС_Связи.Сдвинуть(Элементы.АС_Связи.ТекущаяСтрока-1,-кол);
	//КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитамиНаСервере()
	  ТекОбъект = Элементы.АС_Объекты.ТекущиеДанные;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитами(Команда)
	ЗаполнитьРеквизитамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура АС_ОбъектыАС_ПодсистемаПриИзмененииНаСервере(АС_Объект, АС_Подсистема)
	Если ЗначениеЗаполнено(АС_Объект) Тогда
		ТекОбъект = АС_Объект.ПолучитьОбъект();
		ТекОбъект.Подсистема = АС_Подсистема;
		ТекОбъект.Записать();
	КонецЕсли;
КонецПроцедуры                                                              
 
&НаКлиенте
Процедура АС_ОбъектыАС_ПодсистемаПриИзменении(Элемент)
	ТекСтрока = Элементы.АС_Объекты.ТекущиеДанные;
	АС_ОбъектыАС_ПодсистемаПриИзмененииНаСервере(ТекСтрока.АС_Объект, ТекСтрока.АС_Подсистема);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренести(Команда)
	ТекСтрока = Элементы.АС_Объекты.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекСтрока.АС_Объект) Тогда 		
		Структура = Новый Структура;
		Структура.Вставить("Индентификатор"	, ТекСтрока.АС_Имя);
		Структура.Вставить("Наименование"	, ТекСтрока.АС_Синоним);  
		Структура.Вставить("Вид" 			, Объект.ВидОбъекта);
		
		ОбъектАС = НайтиАС_ОбъектПоИндентификатору(ТекСтрока.АС_Имя); 
		Если Не ЗначениеЗаполнено(ОбъектАС) Тогда 
			ОбъектАС = АС_ОбщийМодульСервер.СоздатьОбъектАС(Структура);
		КонецЕсли;
		
		ТекСтрока.АС_Объект = ОбъектАС;
	КонецЕсли;  
	
	СпРеквизитов = ПолучитьСписокРеквизитовСсылка(ТекСтрока.АС_Объект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокРеквизитовСсылка(АС_Объект)
	
	СпРеквизитов = Новый Массив;
	
	Для Каждого тРеквизит Из АС_Объект.АС_Реквизиты Цикл 		
		Если СтрНайти(тРеквизит.РеквизитТип,"Справочник", ,,) > 0 Тогда 
			
			Отбор = Новый Структура;
			Отбор.Вставить("АС_Объект"	, АС_Объект);
			Отбор.Вставить("АС_Реквизит", тРеквизит.РеквизитСиноним); 
			
			ПоискСтрок = Объект.АС_Связи.НайтиСтроки(Отбор);
			Если ПоискСтрок.Количество() = 0 Тогда 	
				НоваяСтрока  = Объект.АС_Связи.Добавить();
				НоваяСтрока.АС_Объект 	= АС_Объект;
				НоваяСтрока.АС_Реквизит = тРеквизит.РеквизитСиноним;
				
				Индентификатор 				= Сред(тРеквизит.РеквизитТип, 12);
				ОбъектСвязь 				= Справочники.АС_Объекты.НайтиПоРеквизиту("Индентификатор",Индентификатор); 
				НоваяСтрока.АС_ОбъектСвязь 	= ОбъектСвязь; 
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат СпРеквизитов;
	
КонецФункции

Функция НайтиАС_ОбъектПоИндентификатору(Индентификатор)
	 
	Возврат Справочники.АС_Объекты.НайтиПоРеквизиту("Индентификатор",Индентификатор); 
	
КонецФункции	