
&НаСервере
Процедура КомандаЗаполнитьНаСервере()
		Объект.АС_Объекты.Очистить(); 
	
	Для Каждого Метаданное Из Метаданные.Справочники Цикл 
		НовСтрока = Объект.АС_Объекты.Добавить();
		НовСтрока.АС_Имя 		= Метаданное.Имя;
		НовСтрока.АС_Синоним 	= Метаданное.Синоним;  
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	Объект.НазваниеВерсияКонфигурации =  Метаданные.КраткаяИнформация + " " + Метаданные.Версия;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры
