
&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	
	Объект.АС_Объекты.Очистить(); 
	
	Для Каждого Метаданное Из Метаданные.Справочники Цикл 
		НовСтрока = Объект.АС_Объекты.Добавить();
		НовСтрока.АС_Имя 		= Метаданное.Имя;
		НовСтрока.АС_Синоним 	= Метаданное.Синоним;  		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	Объект.НазваниеВерсияКонфигурации =  Метаданные.КраткаяИнформация + " " + Метаданные.Версия;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьОбъект(Команда)
	ТекСтрока = Элементы.АС_Объекты.ТекущиеДанные;
	
	Структура = Новый Структура;
	Если ЗначениеЗаполнено(ТекСтрока.АС_Объект) = Ложь Тогда 
		Структура.Вставить("Индентификатор"	, ТекСтрока.АС_Имя);
		Структура.Вставить("Наименование"	, ТекСтрока.АС_Синоним);  
		Структура.Вставить("Вид" 			, Объект.ВидОбъекта);
		
		ОбъектАС = АС_ОбщийМодульСервер.СоздатьОбъектАС(Структура);   
		
		ТекСтрока.АС_Объект = ОбъектАС; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АС_СвязиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//Если НоваяСтрока Тогда 
	//	текСтрока = Элементы.АС_Связи.ТекущиеДанные;  
	//	кол = Объект.АС_Связи.Количество()-1;
	//	Объект.АС_Связи.Сдвинуть(Элементы.АС_Связи.ТекущаяСтрока-1,-кол);
	//КонецЕсли;	
КонецПроцедуры
