
&НаСервере
Процедура КомандаЗаполнитьНаСервере()
		Объект.АС_Объекты.Очистить(); 
	
	Для Каждого Метаданное Из Метаданные.Справочники Цикл 
		НовСтрока = Объект.АС_Объекты.Добавить();
		НовСтрока.АС_Имя 		= Метаданное.Имя;
		НовСтрока.АС_Синоним 	= Метаданное.Синоним;  
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	Объект.НазваниеВерсияКонфигурации =  Метаданные.КраткаяИнформация + " " + Метаданные.Версия;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьОбъектАССервер(Структура)
	НовАС_Объект = Справочники.АС_Объекты.СоздатьЭлемент();	
	НовАС_Объект.Индентификатор = Структура.Индентификатор;
	НовАС_Объект.Наименование  	= Структура.Наименование; 
	НовАС_Объект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьОбъект(Команда)
	ТекСтрока = Элементы.АС_Объекты.ТекущиеДанные;
	
	Структура = Новый Структура;
	Если ЗначениеЗаполнено(ТекСтрока.АС_Объект) = Ложь Тогда 
		Структура.Вставить("Индентификатор"	, ТекСтрока.АС_Имя);
		Структура.Вставить("Наименование"	, ТекСтрока.АС_Синоним);
	КонецЕсли;
	
	СоздатьОбъектАССервер(Структура);
КонецПроцедуры
