
&НаСервере
Процедура КомандаЗаполнитьНаСервере() 
	
	АС_ОбщийМодульСервер.ЗаполнитьРеквизитыОбъектаАС(Объект.Ссылка); 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда) 
	
	КомандаЗаполнитьНаСервере();
	
	ЭтаФорма.Прочитать(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцедурыФункцииПриАктивизацииСтроки(Элемент)
	СпрСсылка = Элементы.ПроцедурыФункции.ТекущиеДанные.Наименование;
	ЗаполнитьОписаниеТекстомФункции(СпрСсылка);
КонецПроцедуры  

 &НаСервере
 Процедура ЗаполнитьОписаниеТекстомФункции(СпрСсылка)
	 
	 Объект.Описание =   СпрСсылка.ТекстМодуля;
	 
КонецПроцедуры	 
