
&НаСервере
Процедура КомандаЗаполнитьНаСервере() 
	
	Объект.АС_Реквизиты.Очистить(); 
	
	тВид 			= Строка(Объект.Вид); 	
	ИД 				= Объект.Индентификатор;
	
	Для Каждого Метаданное Из Метаданные[тВид][ИД].Реквизиты Цикл 
		НовСтрока = Объект.АС_Реквизиты.Добавить(); 
		НовСтрока.РеквизитСиноним 	= Метаданное.Синоним;
		НовСтрока.РеквизитИмя 		= Метаданное.Имя;		
		НовСтрока.РеквизитТип 		= Метаданное.Тип;
		
		//ТипыР = Метаданное.Тип.Типы();
		//Для Каждого стрТип Из ТипыР Цикл
		//	ПоискТип = Метаданные.НайтиПоТипу(стрТип);
		//	Если Не ПоискТип = Неопределено Тогда  
		//		ТипР = Метаданные.НайтиПоТипу(стрТип).ПолноеИмя();
		//		
		//		текСправочник = Метаданные.НайтиПоТипу(стрТип).Имя; 
		//	КонецЕсли;
		//КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры
