
Функция СоздатьОбъектАС(Структура)  Экспорт 
	 
	НовАС_Объект = Справочники.АС_Объекты.СоздатьЭлемент();	
	НовАС_Объект.Индентификатор = Структура.Индентификатор;
	НовАС_Объект.Наименование  	= Структура.Наименование; 
	НовАС_Объект.Вид            = Структура.Вид;
	НовАС_Объект.Подсистема     = Структура.Подсистема;
	НовАС_Объект.Изменен        = Структура.Изменен;

	НовАС_Объект.Записать();
	
	ЗаполнитьРеквизитыОбъектаАС(НовАС_Объект.Ссылка);

	Возврат НовАС_Объект.Ссылка;
	
КонецФункции 

Процедура ЗаполнитьРеквизитыОбъектаАС(Ссылка) Экспорт
		
	СпрОбъект = Ссылка.ПолучитьОбъект(); 	
	СпрОбъект.АС_Реквизиты.Очистить(); 
		
	Структура = Новый Структура; 
	Структура.Вставить("тВид"	, Строка(СпрОбъект.Вид));
	Структура.Вставить("ИД"		, СпрОбъект.Индентификатор);
	Структура.Вставить("Табл"	, СпрОбъект.АС_Реквизиты);
	Структура.Вставить("ТЧ"		, Неопределено);
	
	ЗаполнитьРеквизитыАС(Структура); 
	
	Для Каждого Метаданное Из Метаданные[Структура.тВид][Структура.ИД].ТабличныеЧасти Цикл 
		ИмяТЧ = Метаданное.Имя;
		ТабЧасть =  Справочники.АС_ТабличныеЧасти.НайтиПоНаименованию(ИмяТЧ);
		
		Если Не ЗначениеЗаполнено(ТабЧасть) Тогда 
			ТабЧасть = СоздатьАС_ТабличныеЧасти(ИмяТЧ);
		КонецЕсли;
		
		Структура.Вставить("ТЧ"		, ТабЧасть);
		
		ЗаполнитьРеквизитыАС(Структура);
	КонецЦикла;	
	
	СпрОбъект.Записать();
		
КонецПроцедуры

Процедура ЗаполнитьРеквизитыАС(Структура) 

	Для Каждого Метаданное Из Метаданные[Структура.тВид][Структура.ИД].Реквизиты Цикл 
		НовСтрока = Структура.Табл.Добавить(); 
		НовСтрока.РеквизитСиноним 	= Метаданное.Синоним;
		НовСтрока.РеквизитИмя 		= Метаданное.Имя;
		
		Если Не Структура.ТЧ = Неопределено Тогда 
			НовСтрока.АС_ТабличнаяЧасть = Структура.ТЧ;
		КонецЕсли;	
		
		ТипыР = Метаданное.Тип.Типы();
		ТипР = "";
		Для Каждого стрТип Из ТипыР Цикл
			ПоискТип = Метаданные.НайтиПоТипу(стрТип);
			Если ПоискТип = Неопределено Тогда 
				РеквизитТип 		= Метаданное.Тип;	
			Иначе 	
				ТипР = ТипР + ?(ТипР = "","","; ") + Метаданные.НайтиПоТипу(стрТип).ПолноеИмя();
				РеквизитТип = ТипР;		
			КонецЕсли;
		КонецЦикла;
		
		НовСтрока.РеквизитТип 			= РеквизитТип; 		 
		НовСтрока.ПроверкаЗаполнения 	= Метаданное.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку; 			
	
	КонецЦикла;

КонецПроцедуры

Функция СоздатьАС_ТабличныеЧасти(ИмяТЧ)
	 СправочникСсылка = Справочники.АС_ТабличныеЧасти.ПустаяСсылка();
	 
	 СправочникОбъект = Справочники.АС_ТабличныеЧасти.СоздатьЭлемент();
	 СправочникОбъект.Наименование = ИмяТЧ;
	 СправочникОбъект.Записать();
	 СправочникСсылка = СправочникОбъект.Ссылка;
	 
	 Возврат СправочникСсылка;
КонецФункции	
