
Функция СоздатьОбъектАС(Структура)  Экспорт 
	 
	НовАС_Объект = Справочники.АС_Объекты.СоздатьЭлемент();	
	НовАС_Объект.Индентификатор = Структура.Индентификатор;
	НовАС_Объект.Наименование  	= Структура.Наименование; 
	НовАС_Объект.Вид            = Структура.Вид;

	НовАС_Объект.Записать();
	
	ЗаполнитьРеквизитыОбъектаАС(НовАС_Объект.Ссылка);

	Возврат НовАС_Объект.Ссылка;
	
КонецФункции 

Процедура ЗаполнитьРеквизитыОбъектаАС(Ссылка) Экспорт
		
	СпрОбъект = Ссылка.ПолучитьОбъект(); 
	
	СпрОбъект.АС_Реквизиты.Очистить(); 
	
	тВид 			= Строка(СпрОбъект.Вид); 	
	ИД 				= СпрОбъект.Индентификатор;
	
	Для Каждого Метаданное Из Метаданные[тВид][ИД].Реквизиты Цикл 
		НовСтрока = СпрОбъект.АС_Реквизиты.Добавить(); 
		НовСтрока.РеквизитСиноним 	= Метаданное.Синоним;
		НовСтрока.РеквизитИмя 		= Метаданное.Имя;		 
		
		ТипыР = Метаданное.Тип.Типы();
		ТипР = "";
		Для Каждого стрТип Из ТипыР Цикл
			ПоискТип = Метаданные.НайтиПоТипу(стрТип);
			Если ПоискТип = Неопределено Тогда 
				РеквизитТип 		= Метаданное.Тип;	
			Иначе 	
				ТипР = ТипР + ?(ТипР = "","","; ") + Метаданные.НайтиПоТипу(стрТип).ПолноеИмя();
				РеквизитТип = ТипР;		
			КонецЕсли;
		КонецЦикла;
		
		НовСтрока.РеквизитТип 	= РеквизитТип;
	КонецЦикла;

	СпрОбъект.Записать();
		
КонецПроцедуры	
