
&НаСервере
Процедура КомандаЗаполнитьИспользуемымиНаСервере()
	
	//Объект.АС_Объекты.Очистить();
	//
	//ЗаполнитьИспользуемымиНаСервере("Справочники"	, "Справочник");
	//ЗаполнитьИспользуемымиНаСервере("Документы"		, "Документ");
	//
	//МетаданныеОбъектов = Метаданные["РегистрыСведений"];

	//Для каждого Метаданное Из МетаданныеОбъектов Цикл  
	//	ТекстЗАпроса = ""; 
	//	ТекстЗАпроса = ТекстЗАпроса + "ВЫБРАТЬ КОЛИЧЕСТВО(*) ИЗ РегистрСведений."+ Метаданное.Имя + " Как ЧислоЗаписей";
	//	
	//	Запрос = Новый Запрос(ТекстЗАпроса);
	//	
	//	Попытка
	//		Результат = Запрос.Выполнить(); 
	//		Выборка = Результат.Выбрать();
	//		
	//		Выборка.Следующий();
	//		
	//		Если Выборка.Поле1 > 0 Тогда 
	//			НоваяСтрока = Объект.АС_Объекты.Добавить();
	//			НоваяСтрока.АС_ВидОбъекта 	= Перечисления.АС_ВидОбъектов.РегистрСведений;
	//			НоваяСтрока.АС_Имя 		= Метаданное.Имя; 
	//			НоваяСтрока.АС_Синоним  = Метаданное.Синоним;
	//			НоваяСтрока.АС_Количество  = Выборка.Поле1;	
	//		КонецЕсли;	
	//		
	//	Исключение
	//	КонецПопытки;				
	//				
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИспользуемымиНаСервере(ДляМетаданных, ДляЗапроса)

	//МетаданныеОбъектов = Метаданные[ДляМетаданных]; 
	//
	//Для каждого Метаданное Из МетаданныеОбъектов Цикл
	//	ТекстЗАпроса = "";		
	//	ТекстЗАпроса = ТекстЗАпроса + Строка("ВЫБРАТЬ " + СокрЛП(Метаданное.Имя) + ".Ссылка КАК Мет ИЗ "+ДляЗапроса+"."+ СокрЛП(Метаданное.Имя) + " как " + СокрЛП(Метаданное.Имя)); 
	//	
	//	Запрос = Новый Запрос(ТекстЗАпроса);
	//	
	//	Попытка
	//		Результат = Запрос.Выполнить(); 
	//		Выборка = Результат.Выбрать();
	//		
	//		КК = 0;
	//		Пока Выборка.Следующий() Цикл
	//			КК = КК + 1; 
	//		КонецЦикла;
	//		Если КК > 0 Тогда 
	//			НоваяСтрока = Объект.АС_Объекты.Добавить(); 
	//			НоваяСтрока.АС_ВидОбъекта 	= Перечисления.АС_ВидОбъектов[ДляМетаданных];
	//			НоваяСтрока.АС_Имя 			= Метаданное.Имя; 
	//			НоваяСтрока.АС_Синоним  	= Метаданное.Синоним;
	//			НоваяСтрока.АС_Количество  	= КК;
	//			
	//			//Сообщить(""+СокрЛП(Метаданное.Имя)+" ; "+СокрЛП(КК));  
	//		КонецЕсли;
	//		
	//	Исключение
	//	КонецПопытки;
	//КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьИспользуемыми(Команда)
	КомандаЗаполнитьИспользуемымиНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	
	Объект.рс_Метаданные.Очистить(); 
	
	ЗаполнитьВидОбъекта(Неопределено, "Справочники"); 
	ЗаполнитьВидОбъекта(Неопределено, "Документы");
	ЗаполнитьВидОбъекта(Неопределено, "РегистрыСведений");
	ЗаполнитьВидОбъекта(Неопределено, "РегистрыНакопления");
	ЗаполнитьВидОбъекта(Неопределено, "Отчеты");
	ЗаполнитьВидОбъекта(Неопределено, "Обработки");
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьВидОбъекта(Соединение, Вид)
	Для Каждого Метаданное Из Метаданные[Вид] Цикл 
		НовСтрока = Объект.рс_Метаданные.Добавить();
		НовСтрока.рс_Имя 		= Метаданное.Имя;
		НовСтрока.рс_Синоним 	= Метаданное.Синоним; 
		НовСтрока.рс_ВидОбъекта = Перечисления.рс_ВидОбъектов[Вид];		
		//НовСтрока.рс_Объект 	= ОбщийМодульСервер.НайтиОбъект(Вид, Метаданное.Синоним); 
        НовСтрока.рс_Количество = ПолучитьКоличествоВБД(Вид, Метаданное.Имя, Метаданное.ПолноеИмя());
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоВБД(Вид, МетаданноеИмя, ПолноеИмя)
	КК = 0;  
	
	Если Вид = "Справочники" Тогда 
		МетаданноеВид = "Справочник."; 
	ИначеЕсли Вид = "Документы" Тогда 
		МетаданноеВид = "Документ.";
	ИначеЕсли Вид = "РегистрыНакопления" Тогда 
		МетаданноеВид = "РегистрНакопления."  
	ИначеЕсли Вид = "РегистрыСведений" Тогда 
		МетаданноеВид = "РегистрСведений."	
	КонецЕсли;
	
	Если Вид = "Справочники" Или  Вид = "Документы" Тогда 
		Попытка
			ТекстЗАпроса 	= "";
			ТекстЗАпроса = ТекстЗАпроса + Строка("ВЫБРАТЬ " + СокрЛП(МетаданноеИмя) + ".Ссылка КАК Док ИЗ "+ МетаданноеВид + СокрЛП(МетаданноеИмя) + " как " + СокрЛП(МетаданноеИмя)); 
			Запрос = Новый Запрос(ТекстЗАпроса);  	
			Результат = Запрос.Выполнить();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки; 
		
		Попытка
			Выборка = Результат.Выбрать();		
			Пока Выборка.Следующий() Цикл
				КК = КК + 1;
			КонецЦикла; 
		Исключение
			КК = 0;		
		КонецПопытки;   		
	КонецЕсли;
	
	Если Вид = "РегистрыСведений" Или  Вид = "РегистрыНакопления" Тогда 
		
		ТекстЗАпроса 	= "";
		ТекстЗАпроса 	= ТекстЗАпроса + Строка("ВЫБРАТЬ КОЛИЧЕСТВО(*) ИЗ " + МетаданноеВид + СокрЛП(МетаданноеИмя) + " как " + СокрЛП(МетаданноеИмя)); 
		
		Запрос = Новый Запрос(ТекстЗАпроса);  
		Попытка
			Результат = Запрос.Выполнить(); 
			
			Выборка = Результат.Выбрать();
		
			Пока Выборка.Следующий() Цикл
				Если Выборка.Поле1 > 0 ТОгда
					
					МассивИменМетаданных = Новый Массив();
					МассивИменМетаданных.Добавить(ПолноеИмя); 
					
					РазмерДанных = ОКР(ПолучитьРазмерДанныхБазыДанных(,МассивИменМетаданных)/1024,3);
					
					КК 	= РазмерДанных;
					
				КонецЕсли;
			КонецЦикла;

		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки; 

	КонецЕсли;	
	
	Возврат КК;
	
КонецФункции	
//////////////////////////////////////////////////////////////

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВерсиюКонфигурацииНаСервере()
	Объект.НазваниеВерсияКонфигурации =  Метаданные.КраткаяИнформация + " " + Метаданные.Версия;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКонфигурации(Команда)
	ОбновитьВерсиюКонфигурацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьОбъект(Команда)
	//ТекСтрока = Элементы.АС_Объекты.ТекущиеДанные;
	//
	//Структура = Новый Структура;
	//Если ЗначениеЗаполнено(ТекСтрока.АС_Объект) = Ложь Тогда 
	//	Структура.Вставить("Индентификатор"	, ТекСтрока.АС_Имя);
	//	Структура.Вставить("Наименование"	, ТекСтрока.АС_Синоним);  
	//	Структура.Вставить("Вид" 			, ?(ЗначениеЗаполнено(ТекСтрока.АС_ВидОбъекта), ТекСтрока.АС_ВидОбъекта,Объект.ВидОбъекта));
	//	Структура.Вставить("Подсистема" 	, ТекСтрока.АС_Подсистема);
	//	Структура.Вставить("Изменен" 		, ТекСтрока.Изменен);
	//	
	//	ОбъектАС = АС_ОбщийМодульСервер.СоздатьОбъектАС(Структура);   
	//	
	//	ТекСтрока.АС_Объект = ОбъектАС; 
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АС_СвязиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//Если НоваяСтрока Тогда 
	//	текСтрока = Элементы.АС_Связи.ТекущиеДанные;  
	//	кол = Объект.АС_Связи.Количество()-1;
	//	Объект.АС_Связи.Сдвинуть(Элементы.АС_Связи.ТекущаяСтрока-1,-кол);
	//КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитамиНаСервере()
	  ТекОбъект = Элементы.АС_Объекты.ТекущиеДанные;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитами(Команда)
	ЗаполнитьРеквизитамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура АС_ОбъектыАС_ПодсистемаПриИзмененииНаСервере(Структура)
	//Если ЗначениеЗаполнено(Структура.АС_Объект) Тогда
	//	ТекОбъект = Структура.АС_Объект.ПолучитьОбъект();
	//	ТекОбъект.Подсистема 	= Структура.АС_Подсистема;
	//	ТекОбъект.Изменен 		= Структура.Изменен;
	//	ТекОбъект.Записать();
	//КонецЕсли;
КонецПроцедуры                                                              
 
&НаКлиенте
Процедура АС_ОбъектыАС_ПодсистемаПриИзменении(Элемент)
	//ТекСтрока = Элементы.АС_Объекты.ТекущиеДанные;
	//
	//Структура = Новый Структура;
	//Структура.Вставить("АС_Объект"		,ТекСтрока.АС_Объект);
	//Структура.Вставить("АС_Подсистема"	,ТекСтрока.АС_Подсистема);
	//Структура.Вставить("Изменен"		,ТекСтрока.Изменен);
	//
	//АС_ОбъектыАС_ПодсистемаПриИзмененииНаСервере(Структура);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренести(Команда)
	//ТекСтрока = Элементы.АС_Объекты.ТекущиеДанные;
	//Если Не ЗначениеЗаполнено(ТекСтрока.АС_Объект) Тогда 		
	//	Структура = Новый Структура;
	//	Структура.Вставить("Индентификатор"	, ТекСтрока.АС_Имя);
	//	Структура.Вставить("Наименование"	, ТекСтрока.АС_Синоним);  
	//	Структура.Вставить("Вид" 			, Объект.ВидОбъекта);
	//	
	//	ОбъектАС = НайтиАС_ОбъектПоИндентификатору(ТекСтрока.АС_Имя); 
	//	Если Не ЗначениеЗаполнено(ОбъектАС) Тогда 
	//		ОбъектАС = АС_ОбщийМодульСервер.СоздатьОбъектАС(Структура);
	//	КонецЕсли;
	//	
	//	ТекСтрока.АС_Объект = ОбъектАС;
	//КонецЕсли;  
	//
	//СпРеквизитов = ПолучитьСписокРеквизитовСсылка(ТекСтрока.АС_Объект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокРеквизитовСсылка(АС_Объект)
	
	//СпРеквизитов = Новый Массив;
	//
	//Для Каждого тРеквизит Из АС_Объект.АС_Реквизиты Цикл 		
	//	Если СтрНайти(тРеквизит.РеквизитТип,"Справочник", ,,) > 0 Тогда 
	//		
	//		Отбор = Новый Структура;
	//		Отбор.Вставить("АС_Объект"	, АС_Объект);
	//		Отбор.Вставить("АС_Реквизит", тРеквизит.РеквизитСиноним); 
	//		
	//		ПоискСтрок = Объект.АС_Связи.НайтиСтроки(Отбор);
	//		Если ПоискСтрок.Количество() = 0 Тогда 	
	//			НоваяСтрока  = Объект.АС_Связи.Добавить();
	//			НоваяСтрока.АС_Объект 	= АС_Объект;
	//			НоваяСтрока.АС_Реквизит = тРеквизит.РеквизитСиноним;
	//			
	//			Индентификатор 				= Сред(тРеквизит.РеквизитТип, 12);
	//			ОбъектСвязь 				= Справочники.АС_Объекты.НайтиПоРеквизиту("Индентификатор",Индентификатор); 
	//			НоваяСтрока.АС_ОбъектСвязь 	= ОбъектСвязь; 
	//		КонецЕсли;	
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	//
	//Возврат СпРеквизитов;
	
КонецФункции

&НаСервере
Функция НайтиАС_ОбъектПоИндентификатору(Индентификатор)
	 
	Возврат Справочники.рс_Объекты.НайтиПоРеквизиту("Индентификатор",Индентификатор); 
	
КонецФункции

